Hi @TTTouper, 
When you submit the POST request to
https://ecs.eu-de.otc.t-systems.com/v2.1/a54e3de98fc64fb8914f28547ffbd7e2/servers,
and API responds with
{ "badRequest": { "message": "the key_name is invalid", "code": "400" } }.

This error means that is returned directly by the Open Telekom Cloud API, not by Terraform.

Do you know who created the SSH key being referenced, was it created by the same user account that the Terraform script runs under? 

From my side, it looks like the RFS account doesn’t have access to existing keys. When I used your script with a pre-created key (generated outside of RFS), everything worked fine.

```
terraform {
  required_version = ">= 1.10.0"

  required_providers {
    opentelekomcloud = {
      source  = "opentelekomcloud/opentelekomcloud"
      version = ">= 1.36.0"
    }
  }
}

provider "opentelekomcloud" {
  cloud = "terraform"
}

###############################################################################
# Variables
###############################################################################

variable "vpc_name" {
  type        = string
  description = "vpc name"
  default     = "rf_test_stack_example_vpc"
  sensitive   = true
  nullable    = false
}

variable "subnet_name" {
  type        = string
  description = "subnet name"
  default     = "rf_test_stack_example_subnet"
}

variable "ecs_name" {
  type        = string
  description = "ecs name"
  default     = "rf_test_stack_example_ecs"
}

variable "compute_keypair_name" {
  type        = string
  description = "ecs compute key pair name"
  default     = "rf_test_stack_example_keypair"
}

variable "storage_volume_name" {
  type        = string
  description = "storage volume name"
  default     = "rf_test_stack_example_volume"
}

###############################################################################
# Resources
###############################################################################

resource "opentelekomcloud_vpc_v1" "rf_doc_vpc" {
  name = var.vpc_name
  cidr = "192.168.0.0/16"
}

resource "opentelekomcloud_vpc_subnet_v1" "rf_doc_subnet" {
  name       = var.subnet_name
  vpc_id     = opentelekomcloud_vpc_v1.rf_doc_vpc.id
  cidr       = "192.168.1.0/24"
  gateway_ip = "192.168.1.1"
}

resource "opentelekomcloud_compute_instance_v2" "rf_doc_ecs" {
  name              = var.ecs_name
  flavor_id         = "s2.large.1"
  image_id          = "bf0f71bd-f08a-4cd0-9594-ca2caa00b9d7"
  availability_zone = "eu-de-01"

  key_pair = var.compute_keypair_name

  security_groups = ["default"]

  network {
    uuid = opentelekomcloud_vpc_subnet_v1.rf_doc_subnet.id
  }
}

resource "opentelekomcloud_blockstorage_volume_v2" "rf_doc_volume" {
  name              = var.storage_volume_name
  size              = 4
  availability_zone = "eu-de-01"
}

resource "opentelekomcloud_compute_volume_attach_v2" "rf_doc_volume_attach" {
  instance_id = opentelekomcloud_compute_instance_v2.rf_doc_ecs.id
  volume_id   = opentelekomcloud_blockstorage_volume_v2.rf_doc_volume.id
}

###############################################################################
# Outputs
###############################################################################

output "ecs_address" {
  value       = opentelekomcloud_compute_instance_v2.rf_doc_ecs.access_ip_v4
  description = "The ecs private address."
}

output "ecs_id" {
  value       = opentelekomcloud_compute_instance_v2.rf_doc_ecs.id
  description = "The ecs resource id."
}

```
and result:
```
terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # opentelekomcloud_blockstorage_volume_v2.rf_doc_volume will be created
  + resource "opentelekomcloud_blockstorage_volume_v2" "rf_doc_volume" {
      + attachment        = (known after apply)
      + availability_zone = "eu-de-01"
      + cascade           = false
      + device_type       = "VBD"
      + id                = (known after apply)
      + metadata          = (known after apply)
      + name              = "rf_test_stack_example_volume"
      + region            = (known after apply)
      + size              = 4
      + volume_type       = (known after apply)
      + wwn               = (known after apply)
    }

  # opentelekomcloud_compute_instance_v2.rf_doc_ecs will be created
  + resource "opentelekomcloud_compute_instance_v2" "rf_doc_ecs" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + auto_recovery       = (known after apply)
      + availability_zone   = "eu-de-01"
      + description         = (known after apply)
      + encrypted_password  = (sensitive value)
      + flavor_id           = "s2.large.1"
      + flavor_name         = (known after apply)
      + id                  = (known after apply)
      + image_id            = "bf0f71bd-f08a-4cd0-9594-ca2caa00b9d7"
      + image_name          = (known after apply)
      + key_pair            = "rf_test_stack_example_keypair"
      + name                = "rf_test_stack_example_ecs"
      + password            = (sensitive value)
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
        ]
      + stop_before_destroy = false
      + volume_attached     = (known after apply)

      + block_device (known after apply)

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # opentelekomcloud_compute_volume_attach_v2.rf_doc_volume_attach will be created
  + resource "opentelekomcloud_compute_volume_attach_v2" "rf_doc_volume_attach" {
      + device      = (known after apply)
      + id          = (known after apply)
      + instance_id = (known after apply)
      + region      = (known after apply)
      + volume_id   = (known after apply)
    }

  # opentelekomcloud_vpc_subnet_v1.rf_doc_subnet will be created
  + resource "opentelekomcloud_vpc_subnet_v1" "rf_doc_subnet" {
      + availability_zone = (known after apply)
      + cidr              = "192.168.1.0/24"
      + cidr_ipv6         = (known after apply)
      + dhcp_enable       = true
      + dns_list          = (known after apply)
      + gateway_ip        = "192.168.1.1"
      + gateway_ipv6      = (known after apply)
      + id                = (known after apply)
      + name              = "rf_test_stack_example_subnet"
      + network_id        = (known after apply)
      + primary_dns       = (known after apply)
      + region            = (known after apply)
      + secondary_dns     = (known after apply)
      + status            = (known after apply)
      + subnet_id         = (known after apply)
      + vpc_id            = (known after apply)
    }

  # opentelekomcloud_vpc_v1.rf_doc_vpc will be created
  + resource "opentelekomcloud_vpc_v1" "rf_doc_vpc" {
      + cidr   = "192.168.0.0/16"
      + id     = (known after apply)
      + name   = (sensitive value)
      + region = (known after apply)
      + shared = (known after apply)
      + status = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ecs_address = (known after apply)
  + ecs_id      = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

opentelekomcloud_vpc_v1.rf_doc_vpc: Creating...
opentelekomcloud_blockstorage_volume_v2.rf_doc_volume: Creating...
opentelekomcloud_vpc_v1.rf_doc_vpc: Creation complete after 7s [id=7f2c831d-ac22-4c21-8cf5-7b11744b1f1c]
opentelekomcloud_vpc_subnet_v1.rf_doc_subnet: Creating...
opentelekomcloud_blockstorage_volume_v2.rf_doc_volume: Still creating... [10s elapsed]
opentelekomcloud_blockstorage_volume_v2.rf_doc_volume: Creation complete after 12s [id=ba30af91-0ce4-4946-b521-01cbe885fba8]
opentelekomcloud_vpc_subnet_v1.rf_doc_subnet: Creation complete after 8s [id=388d97bc-bfbd-4eeb-811e-14149d2ff1aa]
opentelekomcloud_compute_instance_v2.rf_doc_ecs: Creating...
opentelekomcloud_compute_instance_v2.rf_doc_ecs: Still creating... [10s elapsed]
opentelekomcloud_compute_instance_v2.rf_doc_ecs: Still creating... [20s elapsed]
opentelekomcloud_compute_instance_v2.rf_doc_ecs: Creation complete after 28s [id=3ceb55e1-d721-4df1-b2f7-23b4ea85c8f7]
opentelekomcloud_compute_volume_attach_v2.rf_doc_volume_attach: Creating...
opentelekomcloud_compute_volume_attach_v2.rf_doc_volume_attach: Still creating... [10s elapsed]
opentelekomcloud_compute_volume_attach_v2.rf_doc_volume_attach: Still creating... [20s elapsed]
opentelekomcloud_compute_volume_attach_v2.rf_doc_volume_attach: Still creating... [30s elapsed]
opentelekomcloud_compute_volume_attach_v2.rf_doc_volume_attach: Creation complete after 32s [id=3ceb55e1-d721-4df1-b2f7-23b4ea85c8f7/ba30af91-0ce4-4946-b521-01cbe885fba8]

Apply complete! Resources: 5 added, 0 changed, 0 destroyed.

Outputs:

ecs_address = "192.168.1.179"
ecs_id = "3ceb55e1-d721-4df1-b2f7-23b4ea85c8f7"
```

